package Lesson14_Conditional;
//Напишете програма - калкулатор на данъците.
//
//В България имаме плосък данък, което означава, че винаги имаме 10% данък независимо от заплатата ни. Но в някои държави данъка зависи от това колко ни е голяма заплатата.
//
//Именно такъв калкулатор ще направим!
//
//Като за начало, в нашата програма трябва да въведем годишната заплата.
//
//След това да изчислим данъка както следва:
//
//    за първите 20000 няма данък
//    за вторите 20000 има данък от 10%, но само върху парите надвишаващи необлагаемите доходи.
//    за третите 20000 данъкът е както следва: ** 0 за първите 20000 ** 10% за вторите 20000 ** 20% за парите над 40000
//    всички пари над 60000 се таксуват с 30%
import java.util.Scanner;
public class TaxCalculator {
  public static void main(String[] args)
  {
    Scanner input = new Scanner(System.in);
    double salary = input.nextDouble();
    double tax = 0.0;
    double newSalary = 0.0;
    if(salary <= 20000.0)
    {
      tax = 0.0;
    }
    else if(salary > 20000.0 && salary <= 40000.0)
    {
      tax = (salary - 20000.0) * 0.10;
    }
    else if(salary > 40000.0 && salary <= 60000.0)
    {
     tax = 20000.0 * 0.10;
     tax += (salary - 40000.0) * 0.20;
    }
    else if(salary > 60000.0)
    {
      tax = (salary - 60000.0) * 0.30;
    }
    System.out.printf("%.2f", tax);
  }
}
