//Събрали сме плодове, направили сме си джибри и сега е време да преценим кога е най- добрият момент, в който да отидем до казана и да получим дълго чаканата си домашна ракийка.
//
//Знаем, че процесът на ферментация е свързан с бактерии, които преработват захарта в алкохол.
// Освен тези приятни бактерии обаче, има и едни други, не толкова дружелюбни бактерии,
// които преобразуват алкохола в оцет.
//
//Ако приемем, че в началото на процеса имаме 100% захар. За един ден бактериите преобразуват 10%
// (от наличната захар) в алкохол и 1% от алкохола в оцет.
//
//След колко дни трябва да отидем до казана, така че да получим възможно най-много алкохол?
package Lesson15_Loops;

import java.util.Scanner;

public class Rakia {
    public static void main(String[] args)
    {
        Scanner input = new Scanner(System.in);
        double sugar = 1.0;
        double alcohol = 0.0;
        double ocet = 0.0;
        int days = 0;
        while(sugar > 0.0)
        {
            alcohol += sugar * 0.10;
            ocet += sugar * 0.01;
            sugar -= alcohol + ocet;
            days++;
        }
        System.out.println(days);
    }
}
